[{"name":"CHANGELOG.md","content":"# Change Log\r\nAll notable changes to this project are documented in this file.\r\n\r\nThis project adheres to [Semantic Versioning](http://semver.org/) and the changelog is formatted based on [Keep a Changelog](http://keepachangelog.com/).\r\n\r\n## [1.0.28] - 2021-02-05\r\n#### Added\r\n- The Fiori elements generator has been deprecated. Please use the `@sap/generator-fiori` generator which combines the Fiori elements and Fiori freestyle generators.\r\n\r\n## [1.0.27] - 2021-01-22\r\n### Added\r\n- Added ability to generate an application without user interaction by passing a json payload of the relevant answers to the Yeoman command line.\r\n- Added support for destinations in SAP Business Application Studio that have been defined on the instance level rather than account level.\r\n- In VSCode, moved non-confidential information for saved SAP systems out of the operating system secure storage.\r\n- Added SAP Systems panel in VSCode to allow users delete previously saved systems.\r\n- Generated Fiori applications for a CAP project can now add deployment configuration.\r\n\r\n### Fixed\r\n- Improved UX and description when needing to add missing service keys for a generated application at run time.\r\n\r\n## [1.0.25] - 2020-12-10\r\n### Added\r\n- The generator now supports the SAP API Business Hub for data source selection when using VSCode.\r\n\r\n### Fixed\r\n- Ensure correct manifest version is generated for corresponding UI5 version\r\n\r\n## [1.0.24] - 2020-11-25\r\n### Added\r\n- Support for OData V4 data sources for the List Report Object Page and Analytical List Page floorplans.\r\n- The generator now supports the API Business Hub for data source selection in the SAP Business Application Studio.\r\n\r\n### Fixed\r\n- Adding a new SAP system in VSCode now only gets saved when the application is being generated.  Previously this was happening when proceeding from the data source step.\r\n\r\n## [1.0.23] - 2020-11-13\r\n### Added\r\n- Snapshot versions of UI5 now supported on Business Application Studio for internal users.\r\n- Supports generating deployment configuration for Cloud Foundry where the parent folder contains an MTA file.\r\n- Support for launching from CAP project explorer in Business Application Studio.\r\n\r\n### Fixed\r\n- Changing the SAP System to use before generation now correctly resets the proceeding fields.\r\n\r\n## [1.0.21] - 2020-10-27\r\n### Added\r\n- Dropdown selections for services and entities are now sorted alphabetically.\r\n- Module name now allows dash and underscore characters.\r\n\r\n### Fixed\r\n- The suggested project folder to use for generating the application in VSCode now defaults to the open workspace folder.\r\n\r\n\r\n## [1.0.20] - 2020-10-13\r\n### Added\r\n- The associated NPM libraries are now installed in the background after the generator closes for better performance.\r\n\r\n### Fixed\r\n- Sorted SAP system connections alphabetically.\r\n- The `Readme` file generated for each application is now correctly detailed the selected floorplan.\r\n- Fixed warning messages from the generated `manifest.json` file.\r\n\r\n## [1.0.19] - 2020-09-26\r\n### Fixed\r\n- Updated support for SAP system connections.\r\n\r\n## [1.0.18] - 2020-09-25\r\n### Fixed\r\n- Performance improvements to the generation time.\r\n\r\n### Added\r\n- 'Select Qualifier' dropdown not displayed for the Analytical List Page floorplan unless the chosen main entity supports it.\r\n- Mandatory fields in the generator are now represented with a red asterisk.\r\n- When no optional namespace is provided, the generated annotations file will use the default namespace of 'local'.\r\n- List report pages now have the 'useDateRange' manifest property set to 'true' by default.  See https://sapui5.hana.ondemand.com/#/topic/fef65d03d01a4b2baca28983a5449cf7.html for further details.\r\n- Object pages now have the 'defaultLayoutTypeIfExternalNavigation' set to 'MidColumnFullScreen' by default.  See https://sapui5.hana.ondemand.com/#/topic/1d4a0f94bfee48d1b50ca8084a76beec.html for further details.\r\n\r\n## [1.0.17] - 2020-09-10\r\n### Fixed\r\n- The navigation property for a Worklist template now correctly supported.\r\n- Fixed issue in SAP Business Application Studio where generating an application without a workspace open would display an error.\r\n\r\n### Added\r\n- The Analytical List Page floorplan now provides a dropdown list of suitable qualifiers, rather than a free text input.\r\n- Connection error messaging improved in SAP Business Application Studio.\r\n\r\n## [1.0.16] - 2020-09-08\r\n### Fixed\r\n- Data source connections for Cloud URLs in SAP Business Application Studio support basic authentication.\r\n\r\n## [1.0.15] - 2020-08-31\r\n### Fixed\r\n- Data source discovery for Cloud URLs in SAP Business Application Studio no longer requires the ping service to be exposed.\r\n\r\n### Added\r\n- A default saved system name will now be suggested when adding a new SAP system.\r\n- The List Report Object Page V2 and V4 template options have been merged.  The generator now detects the version of the service provided and generates the required application type.\r\n- The minimum version of UI5 supported for V4 applications has been updated to 1.81.0\r\n\r\n## [1.0.14] - 2020-08-20\r\n### Fixed\r\n- The Launch configuration entries for generated projects in VSCode should now work on Windows.  Please ensure you have updated to version 1.48.0 of Microsft Visual Studio Code.\r\n\r\n### Added\r\n- Generated application now includes a `.gitignore` file.\r\n- Support for V4.01 OData services.\r\n- Support for discovering connected Cloud Foundry systems.\r\n- Updated to latest version of `@ui5/cli`.\r\n\r\n## [1.0.13] - 2020-08-13\r\n### Added\r\n- When generating an application for an existing OData V4 CAP project you can now choose whether to add an associated `annotations.cds` file in the advanced options.\r\n\r\n## [1.0.8] - 2020-07-21\r\n### Fixed\r\n- Generated application now contains the correct versions of the `@sap/ux-specification` and `@sap/ux-ui5-tooling` libraries that conform to semantic versioning.\r\n\r\n### Known issues\r\n- VSCode version 1.47.2 and above introduces a breaking change on Windows environments where the launch configuration entries added for your generated projects will not work.  As a workaround:\r\n\r\n  - Go to `preferences` > `settings`\r\n  - Search for `debug preview` and uncheck the `Use the new in-preview JavaScript debugger for Node.js and Chrome` option in both user and workspace\r\n\r\n## [1.0.7] - 2020-07-07\r\n### Fixed\r\n- Generating an OVP application now uses the correct global filter dropdown selection.\r\n- Service URL in lowercase now retrieves correct backend annotations.\r\n\r\n### Added\r\n- Support for the Run Configuration panel in SAP Business Application Studio for any generated applications.\r\n- Namespace field is now optional during generation.\r\n\r\n## [1.0.5] - 2020-06-24\r\n### Fixed\r\n- No longer permitted to generate an application without choosing a valid service.\r\n- Updated name of generated annotation.xml for a worklist application to correctly reflect the manifest entry.\r\n\r\n### Added\r\n- Added tooltips for Analytical template fields to better describe their meaning\r\n- Add more SAP System information to the generated Readme.md\r\n\r\n## [1.0.4] - 2020-06-18\r\n### Fixed\r\n- Explicitly set @sap scope for generated projects to ensure installation completes successfully.\r\n\r\n## [1.0.0] - 2020-06-16\r\nRelease status: GA \r\nWe are pleased to announce the official GA of the SAP Fiori elements application Yeoman templates\r\n\r\n## [0.2.9] - 2020-05-06\r\n### Fixed\r\n- Generated metadata alias for local annotation file\r\n- Updated template titles and description to be consistent.\r\n\r\n### Added\r\n- Readme.md file in generated application now contains details of the options chosen to generate the application.\r\n\r\n## [0.2.8] - 2020-04-22\r\n### Fixed\r\n- Module name with '.' fails to load with mock data.\r\n\r\n### Added\r\n- Added support for Analytical List Page / Object Page Fiori Elements template.\r\n- Added support for Work List Fiori Elements template.\r\n\r\n## [0.2.5] - 2020-04-08\r\n### Fixed\r\n- The entry \"Latest\" is now present at the top of the drop down list for the UI5 version, and only versions of UI5 from 1.65 and above will be presented as options.  Previous versions are not supported.\r\n- Naming for the generated annotation file has been updated.  It has been renamed from `annotation0.xml` to `annotation.xml`.\r\n- Ensure generated annotation file supports multiple schemas from metadata.\r\n\r\n## [0.2.4] - 2020-03-25\r\n### Fixed\r\n- Overview Page manifest generation contains invalid annotations entry \r\n\r\n### Added\r\n- Visual Enhancement, show list of entities in alphabetical order during generation\r\n- Ensure versions of UI5 that are presented during generation are up to date\r\n\r\n\r\n## [0.2.1] - 2020-03-12\r\n### Fixed\r\n- Start parent folder selector at selected folder instead of workspace root\r\n- Allow multiple applications to be run simultaneously\r\n- Improved error messaging when OData Service URL cannot be accessed\r\n- Removed unnecessary `@sap` NPM reference in generated app `.npmrc` file\r\n- OData Url placeholder text (`http://<hostname>:<port>/path/to/odata/service`) should disappear on focus\r\n\r\n### Added\r\n- Wait for install to complete before closing App Generator\r\n- Remove V4 template option for Beta customers.  V4 templates are not yet ready for beta\r\n- Default to the latest version of UI5 when no specific version is selected\r\n\r\n## [0.0.717] - 2020-02-27\r\n### Fixed\r\n- Removed invalid entry from generated `.npmrc` files\r\n- Handle query parameters in OData Service URL\r\n\r\n### Added\r\n- CHANGELOG.md documenting changes\r\n\r\n## [0.0.720] - 2020-02-19\r\n### Added\r\n- Initial version\r\n"},{"name":"generators","nodes":[{"name":"templates","nodes":[{"name":"README.md","content":"## Application Details\r\n|               |\r\n| ------------- |\r\n|**Generation Date and Time**<br><%= genDate %>|\r\n|**App Generator**<br><%= genId %>|\r\n|**App Generator Version**<br><%= genVersion %>|\r\n|**Generation Platform**<br><%= genPlatform %>|\r\n|**Floorplan Used**<br><%= templateLabel %>|\r\n|**Service Type**<br><%= dataSourceLabel %>|<% if(metadataFilename) { %>\r\n|**Metadata File**<br><%= metadataFilename %><% } else { %>\r\n|**Service URL**<br><%= serviceUrl %><%}%>\r\n|**Module Name**<br><%= projectName %>|\r\n|**Application Title**<br><%= projectTitle %>|\r\n|**Namespace**<br><%= projectNamespace %>|\r\n|**UI5 Theme**<br><%= ui5Theme %>|\r\n|**UI5 Version**<br><% if(projectUI5Version===\"\") { %><%= \"Latest\" %> <% }else{%><%= projectUI5Version %><% } %>|\r\n|**Enable Telemetry**<br><% if(enableTelemetry === false) { %><%= \"False\" %><% } else { %><%= \"True\" %><% } %>|<% if (additionalEntries) additionalEntries.forEach(entry => { %>\r\n|**<%= entry.label %>**<br><%= entry.value %>|<%})%>\r\n\r\n## <%= projectName %>\r\n\r\n<%= projectDescription %>\r\n\r\n### Starting the generated app\r\n\r\n-   This app has been generated using the SAP Fiori tools - App Generator, as part of the SAP Fiori tools suite. <% if(additionalTexts) { %> <%=additionalTexts %>\r\n<% } else { %> In order to launch the generated app, simply run the following from the generated app root folder:\r\n\r\n```\r\n    npm start\r\n```\r\n<% if(showMockDataInfo) { %>\r\n- It is also possible to run the application using mock data that reflects the OData Service URL supplied during application generation.  In order to run the application with Mock Data, run the following from the generated app root folder:\r\n\r\n```\r\n    npm run start-mock\r\n```\r\n    <%}%>\r\n<%}%>\r\n#### Pre-requisites:\r\n\r\n1. Active NodeJS LTS (Long Term Support) version and associated supported NPM version.  (See https://nodejs.org)\r\n\r\n\r\n"}]}]},{"name":"README.md","content":"# @sap/generator-fiori-elements\r\n\r\n## Deprecated\r\n\r\nThe **SAP Fiori elements generator** has been deprecated.  There is now an **SAP Fiori generator** that combines both the Fiori freestyle generator and Fiori elements generator.  \r\n\r\nPlease see [@sap/generator-fiori](https://www.npmjs.com/package/@sap/generator-fiori) for full details on the new generator.\r\n"}]