[{"name":"README.md","content":"# @sap/wing-service-explorer\r\n\r\n## Overview\r\n\r\n**Wing-service-explorer** is an npm package that provides the ability to explore SAP services.\r\n\r\n## API\r\n\r\n**Wing-service-explorer** exposes 3 different objects for 3 different SAP systems:\r\n\r\n### ServiceURLExplorer\r\n\r\n---\r\n\r\nThis object exposes APIs for exploration of systems and services defined as OData odata_gen in the account destination list.\r\n\r\n#### getDestinations\r\n\r\nReturns a list of destinations filtered with WebIDEUsage = odata_gen\r\n\r\n#### isFullUrlDestination\r\n\r\nGets as an input a destination object (received from the getDestinations API) and returns **true** if this is a destination to a system\r\nor a service (i.e. if the destination includes a property named full_url and its value is true).\r\n\r\n#### getMetadata\r\n\r\nGets as an input a ConnectionDetails object (which contains the details to connect to a service) and returns the metadata (XML format)\r\nwhich the service exposes.\r\n\r\n### APIHubExplorer\r\n\r\n---\r\n\r\nThis object exposes APIs for exploration of APIs from the APIHub system.\r\n\r\n#### getDestinations\r\n\r\nReturns a list of destinations filtered by WebIDEUsage = apihub_catalog\r\n\r\n#### getListOfAPIs\r\n\r\nGets as an input a destination object (received from the getDestinations API) and returns a list of APIs exposed by the APIHub system.\r\n\r\n#### getApiKey\r\n\r\nGets as an input a destination object and user authetication details (user/password) and returns the user's API key from the APIHub system. (Required for getting the API metadata.)\r\n\r\n#### getMetadata\r\n\r\nGets as an input a ConnectionDetails object (which contains the details to connect to an API) and returns the metadata (XML format)\r\nwhich the API exposes.\r\nNote: The APIHub requires a definition of 2 destinations. The first one for the APIHub system and the second for the API sandbox.\r\n\r\n### ExtensionFactoryExplorer\r\n\r\n---\r\n\r\nThis object exposes APIs for exploration of systems exposed by the Extension Factory.\r\n\r\n#### getDestinations\r\n\r\nReturns a list of destinations which contain an additional property named **XFSystemName**.\r\n"}]