[{"name":"CHANGELOG.md","content":"# Change Log\r\n\r\nAll notable changes to this project will be documented in this file.\r\n\r\nThis project adheres to [Semantic Versioning](http://semver.org/).\r\n\r\nThe format is based on [Keep a Changelog](http://keepachangelog.com/).\r\n\r\n## Unreleased\r\n\r\n## [7.5.5] - 2022-04-21\r\n\r\n* On calc view: Stable sort order with $skip and $top usage for subsequent requests via \"order by\" of key fields in SQL statement\r\n\r\n## [7.5.4] - 2022-04-21\r\n\r\nBuild infrastructure fix\r\n\r\n## [7.5.1] - [7.5.3] - 2022-04-20\r\n\r\nBuild infrastructure fixes\r\n\r\n## [7.5.0] - 2022-03-22\r\n\r\n* Support of node version 16\r\n* Update module dependencies\r\n* Update of system query options and xsodata-settings help text\r\n* Minor changes: Error reporting\r\n\r\n## [7.4.5] - 2021-12-15\r\n\r\n* Suppress $metadata annotation <code>sap:aggregation-role=\"dimension\"</code> on calculation view property if it is used as description property referenced by annotation <code>sap:text</code> by another property of the calulation view. The annotation is only supressed if the corresponding xsodata-file has <code>settings</code> containing this: <code>noDimensionAnnoOnTextProperty true;</code>\r\n* Improvements on URI parsing errors:\r\n  * reporting URI resource path character position on parsing error, if possible\r\n  * Invalid navigation property on <code>$expand</code> system query option returns 400 (Bad Request) instead of 500 (Internal Server Error)\r\n* Removed support for NodeJS version 10\r\n\r\n## [7.4.4] - 2021-07-20\r\n\r\n* HANA client API usage changed: 'execQuery' used for read requests, change requests remain on 'exec'\r\n\r\n## [7.4.2] - 2021-05-05\r\n\r\n* Quote reserve for calcview \"in\" formula\r\n* node version support: 10, 12, 14\r\n\r\n## [7.3.7] - 2021-02-24\r\n\r\n### Fixed\r\n\r\nFor Edm.String typed properties, all single quotes must be preserved.\r\n\r\n## [7.3.5] - 2020-11-23\r\n\r\n### Fixed\r\n\r\nAuthorization header parsing conform to RFC6750\r\n\r\n## [7.3.4] - 2020-10-14\r\n\r\n### Fixed\r\n\r\nadd \"return\" before asynDone to avoid \"Callback was already called\" errors when \"dataCollector* classes\" are called\r\n\r\n## [7.3.3] - 2020-10-01\r\n\r\n### Fixed\r\n\r\nCommit on drop of temporary tables added.\r\n\r\n\r\n## [7.3.2] - 2020-09-30\r\n\r\n## [7.3.1] - 2020-09-29\r\n\r\n### Changed\r\n\r\n* Improved error messages.\r\n\r\n## [7.3.0] - 2020-09-15\r\n\r\n* Aggregation for \"count\":\r\n  * For explicit application the aggregation type \"count\" was not supported in the xsodata file. When\r\n    \"aggregates always (COUNT of \"Amount\");\" was used, a syntax error was thrown.\r\n  * For implicit aggregation, where the aggregation information is loaded from the calcviews measures (e.g.\r\n    using \"aggregates always;\" without a property list in the *.xsodata file), wrongly \"avg\" was used as measure\r\n    type instead of \"count\".\r\n  * With this fix aggregation type \"count\" is now properly supported\r\n    * For explicit application: \"aggregates always (COUNT of \"Amount\");\"\r\n    * For implicit aggregation: calcview measures \"count\" and \"avg\" are now supported property\r\n\r\n* Fix: If a temporary table is not properly dropped by the DB, a second drop step is performed to avoid errors\r\n    when recreating the table.\r\n\r\n## [7.2.0] - 2020-08-19\r\n\r\n* Improve logging infrastructure\r\n\r\n## [7.1.0] - 2020-08-11\r\n\r\n* OData type Edm.Time is mapped to hana types 'TIME' (due to backward compatiblity) which stores only hour, minutes\r\n  and seconds, so only the uri format **time'PT0H0M0S'** was supported. With this fix also the full representation\r\n  like time'P2010Y12M30DT01H02M03S' can be used (some UIs generated it) if the parts of year, mounth and day are zero.\r\n\r\n* Fix for missing annotations (e.g. \"sap:label\") if an calcview without input parameters is exposed as normal view\r\n  (this is without the \"parameter via\" keyword in the xsodata file)\r\n\r\n* Fixes for create, update, delete operations via user-exits on calculation views without input parameters.\r\n  Please note: if the input parameters are omitted and \"via keys\" is used, then the input parameter must be set in\r\n  the exit functions since they are rendered in the output.\r\n\r\n* Explicitly drop prepared statements immediately instead at request end\r\n\r\n## [7.0.3] - 2020-06-30\r\n\r\n### Added\r\n- license file: developer-license-3.1.txt\r\n\r\n## [7.0.2] - 2020-05-18\r\n\r\n* Add support for create, update, delete operations via user-exits on calculation views without input parameters.\r\n  Work for both, calculation views without input parameters exposed as normal view and exposed as calcview.\r\n\r\n## [7.0.1] - 2020-05-12\r\n\r\n* Add support for calculation views without input parameters.\r\n  Before release 7.0.0 calcviews without input parameters have not been supported, but worked accidentally if a calcview\r\n  was wrongly exposed as normal view. After the major release 7.0.0 this wrong exposure of a calcview resulted in an error.\r\n  Because calcviews without input parameters are used more often, the support for this calcviews is now supported.\r\n  You can either expose a calcview as normal view or as proper calcview, for the latter an input parameter entityset with\r\n  parenthesis must be used.\r\n\r\n## [7.0.0] - 2020-04-23\r\n\r\n* Add support for NodeJS version 12\r\n* Removed support for NodeJS version 6\r\n* Fix bug when using a view with explicit key in combination with concurrency token using default properties for ETag.\r\n  Now key properties are not considered for etag generation as written in the \"SAP HANA Developer Guide\":\r\n  _If you specify concurrency token only, then all properties, except the key properties, are used to calculate\r\n  the ETag value. If you provide specific properties, then only those properties are used for the calculation._\r\n\r\n## [6.2.1] - 2020-03-05\r\n\r\n* fixes in release process\r\n\r\n## [6.1.0] - 2020-03-05\r\n\r\n* fixes in release process\r\n\r\n## [6.0.0] - 2020-03-05\r\n\r\n* Add support for LTS Node.js version 12 and 10\r\n* Support for create/update/delete requests on calculation views if \"parameter via keys\" definition is used.\r\nRequirements:\r\n    * input parameters in the calculation view of type ALPHANUM, BLOB, DECIMAL, NVARCHAR, VARBINARY, VARCHAR must have length restriction\r\n    * input parameters in the calculation view of type DECIMAL must have scale restriction\r\n    * all key semantics also apply to keys coming from input parameters\r\n* **IMPORTANT** By default, now a maximum body size of \"10mb\" per request is allowed. More payload leads to an \"413 Payload Too Large\" error. This value of 10mb can be changed with the odata settings in the *.xsodata file\r\n[see **XSOdata Settings**](/documentation/xsodataSettings.md)\r\n\r\n## [5.0.0] - 2019-12-17\r\n\r\n### Info\r\n\r\n* Removed lock when opening a db connection\r\n  The new native hana-client driver used by xsjs is thread save, so the lock for retrieving a new db connection is not required anymore.\r\n  **IMPORTANT** If a custom open function is used, then this function must be reentrant or implement an own lock inside.\r\n\r\n### Fixed\r\n\r\n* When using $count to determine the number of records of an entity set in junction with the limit feature, the\r\nreturned number was also capped by the limit, this was wrong. Now the correct full number of records is returned.\r\n* Fixed typeError if a stored procedure used as custom exit does not return a proper error structure.\r\n\r\n## [4.7.0] - 2019-10-28\r\n\r\n### Fixed\r\n\r\nFixed error causing duplicate properties and property references in the metadata document. Prerequisites:\r\n* The error occurs if an calculation view has been used as source for an entityset\r\n* This calculation view contains an input parameter which is used in more than one measures\r\n* Example: Input parameter \"Input_Currency\" (a calcview variable) is used in the currency conversion for the measures \"VALUE\" and \"TAX\"\r\n\r\n## [4.6.0] - 2019-10-11\r\n\r\n### Fixed\r\n\r\nFixed error \"Error while executing a DB query\" when using an navigation property to navigate from a calculation view to an related entity.\r\n\r\n## [4.5.4] - 2019-08-26\r\n\r\n### Info\r\n\r\n- Update module dependencies\r\n\r\n## [4.5.3] - 2019-08-26\r\n\r\n### Info\r\n\r\n- Update module dependencies\r\n\r\n## [4.5.1] - 2019-08-23\r\n\r\n### Info\r\n\r\n- Updated documentation\r\n\r\n## [4.5.0] - 2019-08-23\r\n\r\n### Info\r\n\r\n- Update module dependencies\r\n- Adopt to new async behaviour\r\n- Adopt to new calcview metadata\r\n\r\n### Fixed\r\n\r\n- Fix bug in error case (duplicate call of callback)\r\n\r\n\r\n## [4.4.0] - 2019-01-25\r\n\r\n- Update module dependencies\r\n- The code field inside an OData error response (error.code) is now correctly send as string (not as number)\r\n- For calcviews the columns type length is determined from the COLUMN_SQL_TYPE if LENGTH is not set.\r\n- Fixed error while parsing multipart/mixed batch requests\r\n\r\n## [4.3.0] - 2018-10-19\r\n\r\n### Info\r\n\r\n- Minimal required @sap/hana-client version is 2.3.123\r\n- Improved test exits\r\n- **IMPORTANT** Conversion: When converting TIMESTAMP db type to OData V2 json payload, only the first 3 digits\r\n of the fractional part are used (OData V2 type DateTime does only supports millisecond precision). With the old\r\n hdb db driver the xsodata library got already only millisecond precision, with the new hana-client db-driver the xsodata\r\n library itself has to remove any digits and use only the millisecond part. The check if the digits for micro- or nanoseconds\r\n are zero and throwing an error if not (added with release 4.0.0) has been removed due to backward  compatibility reasons.\r\n\r\n## [4.2.0] - 2018-09-18\r\n\r\n### Changed\r\n\r\n- Upgraded lodash module dependency to 4.17.11\r\n\r\n## [4.1.0] - 2018-08-31\r\n\r\n### Added\r\n\r\n- Write memory consumption to log if requested\r\n\r\n### Fixed\r\n\r\n- Improve cleanup of temporary tables\r\n\r\n## [4.0.0] - 2018-08-15\r\n\r\n### Added\r\n\r\n- **IMPORTANT**|**INCOMPATIBLE** Added limit feature to restrict the amount of records loaded from the database.\r\n  There are defaults for the limit values [see **XSOdata Settings**](/documentation/xsodataSettings.md) which need to\r\n  be validated before using this version.\r\n- Support for hana-client database connector\r\n- **IMPORTANT**|**INCOMPATIBLE** Switched default database connector from hdb to hana-client\r\n  [see **Database connector**](/documentation/db.md)\r\n\r\n### Fixed\r\n\r\n- Use always the original DB property ordering when copying data into temporary tables for use\r\nin exits in the insert and update steps.\r\n\r\n\r\n## [3.7.0] - 2018-05-22\r\n\r\n### Fixed\r\n\r\n- Update dependencies\r\n\r\n## [3.6.7] - 2018-05-18\r\n\r\n### Fixed\r\n\r\n- Extended DB-Version check to avoid unnecessary cleanup of temporary tables (added new db versions)\r\n- Allow throwing an Error object in custom exits\r\n\r\n## New features with xsodata 3.6.0:\r\n\r\n### Fixed\r\n\r\n- Extended DB-Version check to avoid unnecessary cleanup of temporary tables\r\n- Commands for cleanup of temporary tables don't stop the request processing if tables are truncated/dropped already\r\n- Fixed error which leads to an unclosed db connection. This error occurred only if\r\n   - the xsdata library is used without the xsjs layer (which is not recommended) and\r\n   - the db connection information was provided via host, port, user,... to the OdataHandler\r\n   - as request options for the processRequest method a string containing the uriPrefix is used\r\n   (not an RequestOptions object).\r\n   - $batch processing is used\r\n- Fixed wrong decoding of OData strings of type Edm.String in $filter and $orderby expressions if the string contained\r\nexactly one single quote (e.g. '''' have been decoded wrongly to Json \"\" not to the correct \"'\")\r\n- Parsing milliseconds for Edm.DateTime works now as expected for hana column type TIMESTAMP.\r\n  Sample: HANA value \"9999-12-31T23:59:59.99\" is parsed now to have 990 ms instead of just 99ms\r\n\r\n### Changed\r\n\r\n- Upgraded @sap/xssec module dependencies\r\n\r\n## New features with xsodata 3.5.0:\r\n\r\n### Fixed\r\n\r\n- Proper pattern escaping for substringof, startswith and endswith operations on $filter or $orderby.\r\n- Fixed SQL error when retrieving the row count of calculation views with transparent filters.\r\n\r\n### Added:\r\n\r\n- Added new SQL error class to pass all errors related to DB query execution\r\n\r\n## New features with xsodata 3.4.0:\r\n\r\n### Added:\r\n\r\n- Support for points \".\" in HANA table column names and consistently in OData property names.\r\n  This feature has been added for backward compatibility reasons only. The OData V2 specification does not allow the usage\r\n  of points for property names as points are used to separate namespace parts and names.\r\n  So please consider not using it.\r\n\r\n### Changed\r\n\r\n- Upgraded @sap/xssec and @sap/xsenv module dependencies\r\n\r\n## New features with xsodata 3.3.0:\r\n\r\n### Fixed:\r\n\r\n- Removed failing sql calls to cleanup temporary tables, which become unnecessary with db patch 2.00.030.00.1515544046.\r\n- Numbers of type Edm.Int64 must be represented as string (e.g. \"123\") in json format even if they are within in the range of JS Number.\r\n\r\n## New features with xsodata 3.0.0:\r\n\r\n### Added\r\n\r\n- Support Node.js 4.x.x, 6.x.x and newly 8.x.x\r\n\r\n### Changed\r\n\r\n- Updated dependencies\r\n- Improved content id handling in batch requests\r\n\r\n### Fixed\r\n\r\n- Fixed conversion of binary data if generated key are used\r\n\r\n### Removed\r\n\r\n- Removed support for Node.js 0.12.9\r\n\r\n## New features with xsodata 2.4.0:\r\n\r\n### Added\r\n\r\n- Add \"hints\" setting to xsodata file definition to provide custom hints for SQL-select\r\n\r\n## New features with xsodata 2.3.0:\r\n\r\n### Added\r\n\r\n- Before/After commit exits also called for non batch modifications\r\n- Improved cleanup of temporary tables\r\n- Improved error message when using key property with point '.'\r\n- Rollback performed also for non batch modifications\r\n\r\n### Changed\r\n\r\n- Updated dependencies\r\n\r\n### Fixed\r\n\r\n- Fixed __metadata Uri in payload: name/value key pairs are now correct\r\n\r\n## Modifications with SAP HANA XSA 2.0 SPS 2:\r\n\r\n### Added\r\n\r\n- Request specific logging\r\n- I18N support for language specific metadata, e.g. labels in annotations\r\n- Update of Open Source libraries\r\n\r\n### Fixed\r\n\r\n- Several smaller bug fixes\r\n\r\n## Modifications with SAP HANA XSA 2.0 SPS 1:\r\n\r\n### Added\r\n\r\n- Switch to scoped package name @sap/xsodata\r\n- Support for node.js version 4.X.X & 6.9.X\r\n\r\n## New Features with SAP HANA XSA 2.0 SPS 0:\r\n\r\n### Added\r\n\r\n- [Annotations in metadata](/documentation/annotations.md)\r\n- [Scope based authorization checks](/documentation/authorization.md)\r\n- Support for node.js version 4.4.X & 6.2.X\r\n\r\n## New Features with SAP HANA XSA SPS 12:\r\n\r\n### Added\r\n\r\n- Support for $links requests\r\n- Custom exits for $links requests (modification requests only)\r\n- Support for node.js version 0.12.X & 4.4.X\r\n"},{"name":"README.md","content":"XSODATA\r\n=======\r\n\r\nExpose data from HANA database artifacts like tables or views as OData V2 service with the help of .xsodata service definition files. \r\n\r\nNote: XSOData was developed to provide XS Classic users using XSOData the possibility to migrate to XS Advanced on node.js. \r\n      This library contains nearly the same feature set as XSOData provided on SAP HANA XS Classic. This module is already \r\n      in maintenance mode and it is not planned to extend or enhance it.\r\n      \r\n      If you want to create new OData services we strongly reoommend to use OData V4 along with a generic CDS-OData provider.\r\n      Here you can model your consumption persistency model with CDS (Core Data Services) and expose parts or the complete\r\n      model as OData service. Such a solution is already productively available on the JAVA runtime stack. \r\n      \r\n      For node.js we also provide an OData V4 solution. The development of the OData V4 node.js Library already started in 2016.\r\n      It is also planned that a generic CDS-Odata provider will be deliverd.\r\n\r\n      If you are developing an OData service for SAP Business Technology Platform, it is recommended to move to the SAP Cloud Application Programming Model (CP).\r\n      The XSODATA solution supports HANA as a service, but does **NOT** support SAP HANA Cloud Services (see also SAP note 3013788).\r\n\r\n## Usage\r\n\r\n  * This module is used in the XSJS shim for SAP HANA XSC Engine applications to\r\n    allow the reuse of .xsodata files from XSC applications on SAP HANA XSA.\r\n\r\n  * It can also be used directly in your own nodejs server application. Be aware that you use the same version of the hdb and winston node module version in your application.\r\n  \r\n## Documentation \r\n\r\n[For documentation see here](./documentation.md)\r\n\r\n## Warning\r\n\r\n  * In order to restrict the amount of records loaded from the database (to reduce the memory usage) please use the \r\n    limit setting which can be set in the xsodata file [see here](documentation/xsodataSettings.md)\r\n  * The xsodata library CHANGES the TRANSACTION ISOLATION LEVEL on the used database connection\r\n  * The xsodata library CHANGES the SCHEMA on the used database connection\r\n  * The xsodata library uses temporary tables for performance reasons\r\n  * If you manually modify the db-connection/client inside xsodata-application-exits the modifications you have done\r\n   will not be restored by the xsodata library\r\n  \r\n  So the user of the xsodata library should clean the database connection\r\n  \r\n## Features - Overview\r\n\r\n  * Automatic metadata handling based on XSOData definition and HANA db metadata artifacts\r\n  * OData request handling with URI parsing including system query options\r\n  * OData request/response serialization and deserialization \r\n  * Load table records from HANA database via generated SQL queries\r\n  * Calculation view support\r\n  * Batch handling\r\n  * Logging:\r\n    When the xsjs application log is enabled then xsodata also writes log information.\r\n    If, in addition, the environment variable XSODATA_LOG_MEMORY_CONSUMPTION is set to 'true'\r\n    xsodata writes also memory consumption information to the logs\r\n\r\n\r\n## Supported OData V2 Features:\r\n\r\nGET Requests:\r\n\r\n* URI0 = scheme serviceRoot \r\n* URI1 = scheme serviceRoot \"/\" entitySet\r\n* URI2 = scheme serviceRoot \"/\" entitySet \"(\" keyPredicate \")\"\r\n* URI6 = scheme serviceRoot \"/\" entitySet \"(\" keyPredicate \")/\" entityNavProperty\r\n* URI7 = scheme serviceRoot \"/\" entitySet \"(\" keyPredicate \")/$links/\" entityNavProperty\r\n* URI8 = scheme serviceRoot \"/$metadata\"\r\n* URI9 = scheme serviceRoot \"/$batch\"\r\n* URI15 = scheme serviceRoot \"/\" entitySet count\r\n\r\nCreateUpdateDelete Requests:\r\n\r\n* CUD - Entity\r\n* CUD - Link \r\n\r\n[System Query options](/documentation/supportedSystemQueryOptions.md):\r\n\r\n* $top\r\n* $skip\r\n* $filter, except for:\r\n    * comparison of navigation properties\r\n* $orderby, except for:\r\n    * comparison of navigation properties\r\n* $expand\r\n* $select\r\n* $format\r\n    * only json supported\r\n* $inlinecount\r\n\r\n[Supported HTTP methods per requests type](/documentation/supportedMethods.md)\r\n\r\n## Supported XS1 OData features (defined in the XSOData file):\r\n\r\n  * Definition of OData schema namespace\r\n  * OData Service exposure\r\n  * Metadata caching\r\n  * Create/update/delete restrictions of OData requests\r\n  * Exposure of table and views (including calculation views) as EntitySet\r\n  * Property Projection: Expose a subset of the table columns as properties of an OData EntityType\r\n  * [Automatic OData key generation] (/documentation/generatedKeys.md), e.g. required for aggregated views\r\n  * Simple and complex associations \r\n  * [Data aggregation] (/documentation/aggregations.md)\r\n  * Parameter EntitySets for calculation views\r\n  * ETAG handling\r\n  * Nullable properties\r\n  * Cache Control via cache header\r\n  * [Custom exits] (/documentation/customExits.md) (JavaScript and SQL Script) for modification and validation requests\r\n  * Custom exits in batch requests\r\n  * Uses only UTF-8\r\n  * Uses \"content-type: application/json\" for CREATE, UPDATE, DELETE\r\n  * Expose data only via JSON format (ATOM format is not supported)\r\n  * Supported types and type mapping [see here](/documentation/typemapping.md) \r\n  * [Supported XSOData features by OSDL] (/documentation/xsodataEbnf.md) \r\n  \r\n\r\nNote: \r\n\r\n* XS1 applications using analytical views, attribute views or calculation views <= SAP HANA SPS 10 have to migrate first their views to the new calculation views of SPS 11. \r\n* Authentication/Authorisation is not handled by XSOData node module and has to be done by the application using the node module. \r\n* [The module can be used in development mode and productive mode] (/documentation/modes.md)\r\n* [Debug View is available when using the module in development mode] (/documentation/debugView.md)\r\n\r\n## Features per HANA DB Artifact\r\n\r\n### Table\r\n\r\nSupports the following Features:\r\n- [Explicit Aggregations](/documentation/aggregations.md#explicit-aggregations)\r\n- [Generated Local Key](/documentation/generatedKeys.md)\r\n \r\nSupported Http Verbs:\r\n- GET, PUT, POST, DELETE\r\n\r\n### SQL View\r\n\r\nSupports the following Features:\r\n- [Explicit Aggregations](/documentation/aggregations.md#explicit-aggregations)\r\n- [Generated Local Key](/documentation/generatedKeys.md)\r\n\r\nSupported Http Verbs:\r\n- GET\r\n\r\n### XS Advanced Calculation View\r\n\r\nSupports the following Features:\r\n- [Implicit Aggregations](/documentation/aggregations.md#implicitderived-aggregations)\r\n- [Generated Local Key](/documentation/generatedKeys.md)\r\n\r\nSupported Http Verbs:\r\n- GET\r\n\r\n## Samples\r\n\r\n* [xsodata code samples without xsjs](/documentation/code_samples_pure_node/readme.md)\r\n* [Calcview](/documentation/calcviewSample.md)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"}]